In [71]:
import pandas as pd;
data={"calories":[100,200,300,400],
    "energy":[5,10,15,20]}
df=pd.DataFrame(data)
df

   calories  energy
0       100       5
1       200      10
2       300      15
3       400      20

In [72]:
print(df.loc[0])

calories    100
energy        5
Name: 0, dtype: int64

In [73]:
print(df.loc[3])

calories    400
energy       20
Name: 3, dtype: int64

In [74]:
print(df.loc[[0, 1]])

   calories  energy
0       100       5
1       200      10

In [75]:
print(df.loc[[0,1,2,3]])

   calories  energy
0       100       5
1       200      10
2       300      15
3       400      20

In [76]:
df=pd.DataFrame(data,index=["person1","person2","person3","person4"])
print(df)

         calories  energy
person1       100       5
person2       200      10
person3       300      15
person4       400      20

In [77]:
print(df.loc["person1"])
print(df.loc[["person1","person2"]])

calories    100
energy        5
Name: person1, dtype: int64
         calories  energy
person1       100       5
person2       200      10

In [78]:
import numpy as np;
a=np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]])
df1 = pd.DataFrame(a,columns=['a', 'b', 'c'],index=["[0]","[1]","[2]"])
df1

     a  b  c
[0]  1  2  3
[1]  4  5  6
[2]  7  8  9

In [79]:
df1.index

Index(['[0]', '[1]', '[2]'], dtype='object')

In [80]:
df1.columns

Index(['a', 'b', 'c'], dtype='object')

In [81]:
df.index.name="id"

In [82]:
df

         calories  energy
id
person1       100       5
person2       200      10
person3       300      15
person4       400      20

In [83]:
df.columns.name="value"

In [84]:
df

value    calories  energy
id
person1       100       5
person2       200      10
person3       300      15
person4       400      20

In [85]:
df.head()

value    calories  energy
id
person1       100       5
person2       200      10
person3       300      15
person4       400      20

In [86]:
df.head(2)

value    calories  energy
id
person1       100       5
person2       200      10

In [87]:
df["rank"]=[1,2,3,4]

In [88]:
df

value    calories  energy  rank
id
person1       100       5     1
person2       200      10     2
person3       300      15     3
person4       400      20     4

In [89]:
df["rank1"]=np.arange(4)

In [90]:
df

value    calories  energy  rank  rank1
id
person1       100       5     1      0
person2       200      10     2      1
person3       300      15     3      2
person4       400      20     4      3

In [94]:
df["rank"]=[1,2,3,4]
df["rank1"]=np.arange(4)
df

value    calories  energy  rank  rank1
id
person1       100       5     1      0
person2       200      10     2      1
person3       300      15     3      2
person4       400      20     4      3

In [95]:
del df["rank"]
print(df)

value    calories  energy  rank1
id
person1       100       5      0
person2       200      10      1
person3       300      15      2
person4       400      20      3

In [105]:
p=pd.Series([11,12,13,14],index=[100,101,102,103])
p

100    11
101    12
102    13
103    14
dtype: int64

In [106]:
df["size"]=p
df

value    calories  energy  rank1  size
id
person1       100       5      0   NaN
person2       200      10      1   NaN
person3       300      15      2   NaN
person4       400      20      3   NaN

In [110]:
nestdict={"red":{2023:23,2024:24},
          "blue":{2025:25,2026:26},
          "white":{2027:27,2028:28}}
f=pd.DataFrame(nestdict)
f

       red  blue  white
2023  23.0   NaN    NaN
2024  24.0   NaN    NaN
2025   NaN  25.0    NaN
2026   NaN  26.0    NaN
2027   NaN   NaN   27.0
2028   NaN   NaN   28.0

In [112]:
f.T  #Transpose

       2023  2024  2025  2026  2027  2028
red    23.0  24.0   NaN   NaN   NaN   NaN
blue    NaN   NaN  25.0  26.0   NaN   NaN
white   NaN   NaN   NaN   NaN  27.0  28.0